src_ext/AccumulationRegisters/УЗ_СписанияСуммЗаУроки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_СписанияСуммЗаУроки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЯвок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Явка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_Оповещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_Оповещения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ДополнительныеРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_СписаниеОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасходДенег</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_НачисленияПедагогам</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ПриходДенег</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ГрафикРабочегоВремениПедагога</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_НачислениеБонусов</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ПеремещениеДенег</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Помещения</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасчетЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокамС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОповещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОповещатьОЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/CommonModules/УЗ_Сервер/Ext/Module.bsl
Функция ПолучитьОстаткиЧасовИСумм(Дата, ФизЛицо) Экспорт
	
	Ст = Новый Структура; 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписанияСуммЗаУроки.ЧасыОстаток,
	|	СписанияСуммЗаУроки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.УЗ_СписанияСуммЗаУроки.Остатки(&Дата, ) КАК СписанияСуммЗаУроки
	|ГДЕ
	|	СписанияСуммЗаУроки.Клиент = &Клиент"; 	
	Запрос.УстановитьПараметр("Клиент", ФизЛицо);
	Запрос.УстановитьПараметр("Дата", Дата);	
	РезультатЗапроса = Запрос.Выполнить();	
	Остатки = РезультатЗапроса.Выбрать();
	Пока Остатки.Следующий() Цикл
		Ст.Вставить("КоличествоЧасов", '00010101' + Остатки.ЧасыОстаток);
		Ст.Вставить("Сумма", Остатки.СуммаОстаток);		
	КонецЦикла; 
	
	Возврат Ст;
	
КонецФункции

// Проверияет образовавшуюся задолженность
Процедура ПроверкаЗадолженности() Экспорт 

	Настройки = ПолучитьНастройки();
	
	Если Настройки.ИспользоватьОповещения и Настройки.ОповещатьОЗадолженности <> 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УЗ_СписанияСуммЗаУрокиОстаткиИОбороты.Клиент КАК Клиент,
		|	УЗ_СписанияСуммЗаУрокиОстаткиИОбороты.СуммаКонечныйОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.УЗ_СписанияСуммЗаУроки.ОстаткиИОбороты КАК УЗ_СписанияСуммЗаУрокиОстаткиИОбороты
		|ГДЕ
		|	УЗ_СписанияСуммЗаУрокиОстаткиИОбороты.СуммаКонечныйОстаток < 0";
		Должники = Запрос.Выполнить().Выгрузить();
		Для Каждого Стр из Должники Цикл		
			
			//ПроверитьИДобавитьВОповещения();
			
			НовЗапись = РегистрыСведений.УЗ_Оповещения.СоздатьМенеджерЗаписи();
			НовЗапись.ВремяСобытия = ТекущаяДата();
			НовЗапись.Источник = Стр.Клиент;
			НовЗапись.Описание = "Задолженность на " +ТекущаяДата()+ ": " +Формат(Стр.Остаток,"ЧДЦ=2");
			НовЗапись.Пользователь = Неопределено;
			НовЗапись.СрокНапоминания = НачалоДня(ТекущаяДата()) + 86400; //86400 = 1 день
			НовЗапись.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОповещения() Экспорт 

	МассивОповещений = Новый Массив;
	
	ДанныеС = Новый Структура;
	
	МассивПользователей = Новый Массив;
	МассивПользователей.Добавить(УЗ_Среда.ТекущийПользователь());
	МассивПользователей.Добавить(Справочники.Пользователи.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УЗ_Оповещения.Источник КАК Источник,
	|	УЗ_Оповещения.ВремяСобытия КАК ВремяСобытия,
	|	УЗ_Оповещения.Пользователь КАК Пользователь,
	|	УЗ_Оповещения.Завершено КАК Завершено,
	|	УЗ_Оповещения.СрокНапоминания КАК СрокНапоминания,
	|	УЗ_Оповещения.Описание КАК Описание
	|ИЗ
	|	РегистрСведений.УЗ_Оповещения КАК УЗ_Оповещения
	|ГДЕ
	|	УЗ_Оповещения.Пользователь В(&Пользователи)
	|	И НЕ УЗ_Оповещения.Завершено";
	Запрос.УстановитьПараметр("Пользователи", МассивПользователей);
	Оповещения = Запрос.Выполнить().Выгрузить();
	Для Каждого Оп из Оповещения Цикл
		
		ДанныеС.Вставить("Описание",Оп.Описание);
		ДанныеС.Вставить("Источник",Оп.Источник);
		
		Струк = новый Структура("Источник, Описание, ВремяСобытия, Пользователь, Завершено, СрокНапоминания", 
		Оп.Источник, Оп.Описание, Оп.ВремяСобытия, Оп.Пользователь, Оп.Завершено, Оп.СрокНапоминания,);
		КлючЗаписи = РегистрыСведений.УЗ_Оповещения.СоздатьКлючЗаписи(Струк);
		ДанныеС.Вставить("КлючЗаписи",КлючЗаписи);

		МассивОповещений.Добавить(ДанныеС);
		
	КонецЦикла;
	
	Возврат МассивОповещений;

КонецФункции

Функция ПолучитьНастройки() Экспорт 
	Возврат РегистрыСведений.УЗ_Настройки.Настройки();
КонецФункции
